app/controllers/charts_controller.rb

  def area_chart
    @charts=Chart.all
---
SELECT `charts`.* FROM `charts`

  def index
    # @charts=Chart.all
    if params[:startyear].present?
    @charts=Chart.find(:all, :conditions => ["year >= ? AND year <= ?", params[:startyear], params[:endyear]])
    else
      @charts=Chart.all
---
SELECT `charts`.* FROM `charts` WHERE (year >= 2002 AND year <= 2005)
SELECT `charts`.* FROM `charts`

  def show
    @chart = Chart.find(params[:id])
---
SELECT `charts`.* FROM `charts` WHERE `charts`.`id` = 0 LIMIT 1

  def edit
    @chart = Chart.find(params[:id])
---
SELECT `charts`.* FROM `charts` WHERE `charts`.`id` = 1 LIMIT 1

  def create
    @chart = Chart.new(params[:chart])

    respond_to do |format|
      if @chart.save
---
INSERT INTO `charts` (`year`, `sales`, `expenses`, `created_at`, `updated_at`) VALUES ('2008', 1000, 400, '2012-02-29 04:51:58', '2012-02-29 04:51:58')

  def update
    @chart = Chart.find(params[:id])

    respond_to do |format|
      if @chart.update_attributes(params[:chart])
---
SELECT `charts`.* FROM `charts` WHERE `charts`.`id` = 1 LIMIT 1
UPDATE `charts` SET `year` = '2000', `updated_at` = '2012-02-29 06:34:47' WHERE `charts`.`id` = 1

  def destroy
    @chart = Chart.find(params[:id])
    @chart.destroy
---
SELECT `charts`.* FROM `charts` WHERE `charts`.`id` = 4 LIMIT 1
DELETE FROM `charts` WHERE `charts`.`id` = 4