app/controllers/geos_controller.rb

SELECT `geos`.* FROM `geos`
---
  def index
    @geos = Geo.all

SELECT `geos`.* FROM `geos` WHERE `geos`.`id` = 1 LIMIT 1
---
  def show
    @geo = Geo.find(params[:id])

SELECT `geos`.* FROM `geos` WHERE `geos`.`id` = 1 LIMIT 1
---
  def edit
    @geo = Geo.find(params[:id])

INSERT INTO `geos` (`country`, `popularity`, `created_at`, `updated_at`) VALUES ('Germany', 200, '2012-03-01 05:58:25', '2012-03-01 05:58:25')
---
  def create
    @geo = Geo.new(params[:geo])

    respond_to do |format|
      if @geo.save

SELECT `geos`.* FROM `geos` WHERE `geos`.`id` = 6 LIMIT 1
DELETE FROM `geos` WHERE `geos`.`id` = 6
---
  def destroy
    @geo = Geo.find(params[:id])
    @geo.destroy